Revit 2027 API
ParameterTypeId.SectionParentViewName Property
 "Parent View"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SectionParentViewName { get; }
Public Shared ReadOnly Property SectionParentViewName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SectionParentViewName {
	ForgeTypeId^ get ();
}
static member SectionParentViewName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace